"""
Задание 3.	Сформировать из введенного числа
обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. Решение через цикл не принимается.

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
Не забудьте проверить на числе, которое оканчивается на 0.
"""


def reverse(arr: list[int]):
    if arr:
        return [arr.pop()] + reverse(arr)
    return []


def reverse_int(num: int):
    r = reverse([int(i) for i in str(num)])
    return int(''.join(map(str, r)))


if __name__ == '__main__':
    print(reverse_int(123))
    print(reverse_int(0))
