"""
Задание 2.	Подсчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной.
При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены, рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены
Используем операции % //. Операции взятия по индексу применять нельзя.

Решите через рекурсию. Решение через цикл не принимается.

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def count(num: list[int]):
    if num:
        elem, (evens, odds) = num.pop(), count(num)
        return evens + int(elem % 2 == 0), odds + int(elem % 2 != 0)
    else:
        return 0, 0


def count_odd_even(num: int):
    return count(list(map(int, str(num))))


if __name__ == '__main__':
    print(count_odd_even(12345))
